app/views/questions/_box.html.erb

SELECT COUNT(*) FROM `answers` WHERE `answers`.`question_id` = 1
---
    <p><%= truncate(question.description, :length  => 150) %><a href="#" class="inline">read more...</a> </p>
    <p class="user-log"><a href="<%=question_path(question)%>"><%= question.answers.count %><small>Answers</small></a>  Posted: <small><%= time_ago_in_words(question.created_at)%> ago</small>