app/controllers/answers_controller.rb

	def create
		if(params[:question_id])
			question = Question.find(params[:question_id])
			if question
				@answer = question.answers.create(params[:answer].merge({:user_id => current_user.id}))
				unless @answer.errors.empty?
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
INSERT INTO `answers` (`created_at`, `question_id`, `text`, `title`, `updated_at`, `user_id`) VALUES ('2011-11-25 13:37:42', 1, ' oh my god how can i answer to my own question?', NULL, '2011-11-25 13:37:42', 1)
SELECT COUNT(*) FROM `answers` WHERE `answers`.`question_id` = 1

	def up_vote
		answer = Answer.find(params[:id])
		vote = answer.votes.find_by_user_id(current_user.id)
		vote.delete if vote
		vote = Answer.find(params[:id]).votes.create(:up => true, :user_id => current_user.id)
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
SELECT `votes`.* FROM `votes` WHERE `votes`.`answer_id` = 1 AND `votes`.`user_id` = 1 LIMIT 1
DELETE FROM `votes` WHERE `votes`.`id` = 2
INSERT INTO `votes` (`answer_id`, `created_at`, `up`, `updated_at`, `user_id`) VALUES (1, '2011-11-25 13:39:57', 1, '2011-11-25 13:39:57', 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def down_vote
		answer = Answer.find(params[:id])
		vote = answer.votes.find_by_user_id(current_user.id)
		vote.delete if vote
		vote = Answer.find(params[:id]).votes.create(:up => false, :user_id => current_user.id)
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
SELECT `votes`.* FROM `votes` WHERE `votes`.`answer_id` = 1 AND `votes`.`user_id` = 1 LIMIT 1
DELETE FROM `votes` WHERE `votes`.`id` = 1
INSERT INTO `votes` (`answer_id`, `created_at`, `up`, `updated_at`, `user_id`) VALUES (1, '2011-11-25 13:40:02', 0, '2011-11-25 13:40:02', 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1