app/controllers/comments_controller.rb

SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
---
	def index
		@comments = Answer.find(params[:answer_id]).comments

INSERT INTO `comments` (`comment`, `commentable_id`, `commentable_type`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('test comment', 1, 'Answer', '2011-11-25 13:39:51', '', '2011-11-25 13:39:51', 1)
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
---
	def create
		@comment = Answer.find(params[:answer_id]).comments.create(:comment => params[:comment]['comment'], :user_id => current_user.id)