app/controllers/omniauth_callbacks_controller.rb

	def clear_omniauth
    token = UserToken.find_by_provider_and_uid(session[:omniauth]['provider'], session[:omniauth]['uid'])
    token.user.destroy();
---
SELECT `user_tokens`.* FROM `user_tokens` WHERE `user_tokens`.`provider` = 'twitter' AND `user_tokens`.`uid` = '55580169' LIMIT 1
DELETE FROM `user_tokens` WHERE `user_tokens`.`id` = 2
DELETE FROM `users` WHERE `users`.`id` = 2