app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
	def show
		@question = Question.find(params[:id])

SELECT `questions`.* FROM `questions` WHERE `questions`.`user_id` = 1 ORDER BY id DESC LIMIT 3
---
	def my
		@questions = current_user.questions.order('id DESC').limit(3)

SELECT `categories`.* FROM `categories`
---
	def new
		@question = Question.new
		@categories = Category.all

INSERT INTO `questions` (`category_id`, `created_at`, `dealine`, `description`, `title`, `updated_at`, `user_id`) VALUES (3, '2011-11-25 13:37:14', NULL, 'this is just to test the functionality of posting a question on Fanalyzr', 'test question', '2011-11-25 13:37:14', 1)
---
	def create
		@question = current_user.questions.create(params[:question])