app/controllers/users_controller.rb

SELECT `user_tokens`.* FROM `user_tokens` WHERE `user_tokens`.`uid` = '626415268' LIMIT 1
UPDATE `users` SET `confirmation_token` = '1Gugx1XxZFjsqJ9xHsu6', `confirmation_sent_at` = '2011-11-25 13:36:19', `updated_at` = '2011-11-25 13:36:19' WHERE `users`.`id` = 1
---
	def complete_registration
		token = UserToken.find_by_uid(session[:omniauth]["uid"]) if session[:omniauth] && session[:omniauth]["uid"]
    if token
      user = token.user if token.user
      if user
        user.update_attributes(params[:user])